# DS 2002 Midterm Project
## Sophie Phillips (nsj9fx)
### October 31, 2023
#### Using Sakila Database to demostrate and understanding of and competence creating and implementing basic data science systems

In [8]:
# Import necessary libraries

import os
import json
import numpy
import datetime
import pandas as pd

import pymongo
from sqlalchemy import create_engine

In [9]:
# Declare & assign connection variables to Mongo and SQL

mysql_uid = "root"
mysql_pwd = "SQLpa55"
mysql_hostname = "localhost"

atlas_cluster_name = "cluster0.emquwwq"
atlas_user_name = "nsj9fx"
atlas_password = "cWcL1wAMfv0pTPvU"

conn_str = {"local" : f"mongodb://localhost:27017/",
    "atlas" : f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.mongodb.net"
}

src_dbname = "sakila"
dst_dbname = "sakila_dm"   # Data Mart

print(f"Local Connection String: {conn_str['local']}")
print(f"Atlas Connection String: {conn_str['atlas']}")

Local Connection String: mongodb://localhost:27017/
Atlas Connection String: mongodb+srv://nsj9fx:cWcL1wAMfv0pTPvU@cluster0.emquwwq.mongodb.net

In [3]:
# Populate json files into mongo

client = pymongo.MongoClient(conn_str["atlas"])
db = client[src_dbname]

data_dir = os.path.join(os.getcwd(), 'midterm-data') 

json_files = {"rental" : 'rental_table.json',                           
              "customer" : 'customer_table.json',
        
             }

for file in json_files:
    db.drop_collection(file)
    json_file = os.path.join(data_dir, json_files[file])
    with open(json_file, 'r') as openfile:
        json_object = json.load(openfile)
        file = db[file]
        result = file.insert_many(json_object)
        print(f"{file} was successfully loaded.")  #confirm files were successully loaded 

        
client.close()

Collection(Database(MongoClient(host=['ac-3z5rw8q-shard-00-00.emquwwq.mongodb.net:27017', 'ac-3z5rw8q-shard-00-01.emquwwq.mongodb.net:27017', 'ac-3z5rw8q-shard-00-02.emquwwq.mongodb.net:27017'], document_class=dict, tz_aware=False, connect=True, authsource='admin', replicaset='atlas-tzbg9n-shard-0', tls=True), 'sakila'), 'rental') was successfully loaded.
Collection(Database(MongoClient(host=['ac-3z5rw8q-shard-00-00.emquwwq.mongodb.net:27017', 'ac-3z5rw8q-shard-00-01.emquwwq.mongodb.net:27017', 'ac-3z5rw8q-shard-00-02.emquwwq.mongodb.net:27017'], document_class=dict, tz_aware=False, connect=True, authsource='admin', replicaset='atlas-tzbg9n-shard-0', tls=True), 'sakila'), 'customer') was successfully loaded.

In [4]:
# Define Functions for Getting and Setting Data Into Databases

def get_sql_dataframe(user_id, pwd, host_name, db_name, sql_query):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    conn = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, conn);
    conn.close()
    
    return dframe


def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe


def set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the Pandas DataFrame .to_sql( ) function to either create, or append to, a table'''
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

In [5]:
# from lab03: create the New Data Warehouse database, and to Use it, Switch the Connection Context.
# but used same variable names as lab04 (seen in cell 2)

conn_str = f"mysql+pymysql://{mysql_uid}:{mysql_pwd}@{mysql_hostname}"
sqlEngine = create_engine(conn_str, pool_recycle=3600)

sqlEngine.execute(f"DROP DATABASE IF EXISTS `{dst_dbname}`;")
sqlEngine.execute(f"CREATE DATABASE `{dst_dbname}`;")
sqlEngine.execute(f"USE {dst_dbname};")

In [6]:
# from lab03: extract data from SQL
# change user/pwd variable names again + get_dataframe > get_sql_dataframe

sql_payment = "SELECT * FROM sakila.payment;"
df_payment = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, src_dbname, sql_payment)
df_payment.head(2)

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30
1,2,1,1,573,0.99,2005-05-28 10:35:23,2006-02-15 22:12:30

## mongo
(Tables in Mongo = customer & rental)

#### create and populate new dimension tables

##### extract data from mongo into DataFrames ("df_...")

In [10]:


query = {} # Select all elements (columns), and all documents (rows). - interted into {}
collection = "rental"

df_rental = get_mongo_dataframe(conn_str['atlas'], src_dbname, collection, query)  # Specify 'atlas', or 'local'
df_rental.head(2)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53

In [11]:
query = {} # Select all elements (columns), and all documents (rows). 
collection = "customer"

df_customer = get_mongo_dataframe(conn_str['atlas'], src_dbname, collection, query)  # Specify 'atlas', or 'local'
df_customer.head(2)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20

#### perform transformations to DataFrames
(drop staff_id from rental table, drop address_id and active from customer table, drop last update from both, all "id" changed to "key")

In [12]:
df_rental.drop('staff_id', axis=1, inplace=True) 
df_rental.drop('last_update', axis=1, inplace=True) 

df_rental.rename(columns={"rental_id":"rental_key",
                          "inventory_id":"inventory_key",
                          "customer_id":"customer_key"
                         }, inplace=True)


df_rental.head(2)

,rental_key,rental_date,inventory_key,customer_key,return_date
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33

In [13]:
df_customer.drop('last_update', axis=1, inplace=True) 
df_customer.drop('address_id', axis=1, inplace=True) 
df_customer.drop('active', axis=1, inplace=True) 


df_customer.rename(columns={"customer_id":"customer_key",
                           "store_id":"store_key"
                           }, inplace=True)

df_customer.head(2)

,customer_key,store_key,first_name,last_name,email,create_date
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,2006-02-14 22:04:36
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,2006-02-14 22:04:36

#### Load Transformed DataFrames into the New Data Warehouse by Creating New Tables

In [14]:
dataframe = df_rental
table_name = 'dim_rental'
primary_key = 'rental_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [15]:
dataframe = df_customer
table_name = 'dim_customer'
primary_key = 'customer_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, dataframe, table_name, primary_key, db_operation)

#### Validate that the New Dimension Tables were Created.

In [16]:
sql_rental = "SELECT * FROM sakila_dm.dim_rental;"  #sakila_dm now
df_dim_rental = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_rental) #see how dst db now instead of src
df_dim_rental.head(2)

,rental_key,rental_date,inventory_key,customer_key,return_date
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33

In [17]:
sql_customer = "SELECT * FROM sakila_dm.dim_customer;"
df_dim_customer = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_customer)
df_dim_customer.head(2)

,customer_key,store_key,first_name,last_name,email,create_date
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,2006-02-14 22:04:36
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,2006-02-14 22:04:36

## SQL 
(table in SQL = payment)

#### Create and populate Dimension Tables

##### extract data from source data tables in SQL into DataFrames (from Lab 03)

In [18]:
sql_payment = "SELECT * FROM sakila.payment;"
df_payment = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, src_dbname, sql_payment)
df_payment.head(2)

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30
1,2,1,1,573,0.99,2005-05-28 10:35:23,2006-02-15 22:12:30

#### Perform transformations to DataFrames
(rename "id" to "key", drop staff_id & last_update)

In [19]:
drop_cols = ['staff_id','last_update']  #don't need to do this for just one column, but helpful if you have many
df_payment.drop(drop_cols, axis=1, inplace=True)
df_payment.rename(columns={"payment_id":"payment_key",
                          "customer_id":"customer_key",
                           "rental_id":"rental_key",
                          }, inplace=True)

df_payment.head(2)

   payment_key  customer_key  rental_key  amount        payment_date
0            1             1          76    2.99 2005-05-25 11:30:37
1            2             1         573    0.99 2005-05-28 10:35:23

#### Load Transformed DataFrames into the New Data Warehouse by Creating New Tables

In [20]:
db_operation = "insert"
tables = [('dim_payment',df_payment,'payment_key')]

for table_name, dataframe, primary_key in tables:
    set_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, dataframe, table_name, primary_key, db_operation)

#### Validate that the New Dimension Table was Created.

In [21]:
sql_payment = "SELECT * FROM sakila_dm.dim_payment;"
df_dim_payment = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_payment)
df_dim_payment.head(2)

   payment_key  customer_key  rental_key  amount        payment_date
0            1             1          76    2.99 2005-05-25 11:30:37
1            2             1         573    0.99 2005-05-28 10:35:23

# file from local machine

In [22]:
query = {} # Select all elements (columns), and all documents (rows). - interted into {}
collection = "film"

df_film = pd.read_csv(r'C:\Users\sophi\OneDrive\Documents\DS-2002-main (3)\DS-2002-main\film_table.csv')
df_film.head(2)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42

#### perform transformations to DataFrames
(drop last_update, description, language_id, original_language_id & rename film_id as film_key)

In [23]:
df_film.drop('last_update', axis=1, inplace=True) 
df_film.drop('description', axis=1, inplace=True) 
df_film.drop('language_id', axis=1, inplace=True) 
df_film.drop('original_language_id', axis=1, inplace=True) 

df_film.rename(columns={"film_id":"film_key"
                         }, inplace=True)


df_film.head(2)

,film_key,title,release_year,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,2006,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,2006,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"

#### Load Transformed DataFrames into the New Data Warehouse by Creating New Tables

In [24]:
dataframe = df_film
table_name = 'dim_film'
primary_key = 'film_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, dataframe, table_name, primary_key, db_operation)

#### Validate that the New Dimension Table was Created.

In [25]:
sql_film = "SELECT * FROM sakila_dm.dim_film;"
df_dim_film = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_film)
df_dim_film.head(2)

,film_key,title,release_year,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,2006,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,2006,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"

# create and populate the new fact tables

In [26]:
# join the customer and payment DataFrames on customer_key ("df_"), cps=customer payments

df_fact_cps = pd.merge(df_customer, df_payment, on='customer_key', how='right')
df_fact_cps.head(2)

,customer_key,store_key,first_name,last_name,email,create_date,payment_key,rental_key,amount,payment_date
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,2006-02-14 22:04:36,1,76,2.99,2005-05-25 11:30:37
1,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,2006-02-14 22:04:36,2,573,0.99,2005-05-28 10:35:23

In [27]:
# join the customer payment fact table and rental DataFrame on rental_key ("df_"), crs=customer rentals

df_fact_crs = pd.merge(df_rental, df_fact_cps, on='rental_key', how='right')
df_fact_crs.head(2)

,rental_key,rental_date,inventory_key,customer_key_x,return_date,customer_key_y,store_key,first_name,last_name,email,create_date,payment_key,amount,payment_date
0,76,2005-05-25 11:30:37,3021.0,1.0,2005-06-03 12:00:37,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,2006-02-14 22:04:36,1,2.99,2005-05-25 11:30:37
1,573,2005-05-28 10:35:23,4020.0,1.0,2005-06-03 06:32:23,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,2006-02-14 22:04:36,2,0.99,2005-05-28 10:35:23

In [28]:
# join the customer rentals fact table and film table ("df_"), film_rentals

df_fact_film_rentals = pd.concat([df_film, df_fact_cps], axis=1, join = 'outer', ignore_index=False, sort=False)
df_fact_film_rentals.head(2)

,film_key,title,release_year,rental_duration,rental_rate,length,replacement_cost,rating,special_features,customer_key,store_key,first_name,last_name,email,create_date,payment_key,rental_key,amount,payment_date
0,1.0,ACADEMY DINOSAUR,2006.0,6.0,0.99,86.0,20.99,PG,"Deleted Scenes,Behind the Scenes",1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,2006-02-14 22:04:36,1,76,2.99,2005-05-25 11:30:37
1,2.0,ACE GOLDFINGER,2006.0,3.0,4.99,48.0,12.99,G,"Trailers,Deleted Scenes",1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,2006-02-14 22:04:36,2,573,0.99,2005-05-28 10:35:23

# Get the Data from the Dim Date Table in SQL

In [29]:
sql_dim_date = "SELECT date_key, full_date FROM sakila_dm.dim_date"
df_dim_date = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, src_dbname, sql_dim_date)
df_dim_date.full_date = df_dim_date.full_date.astype('datetime64')
df_dim_date.head(2)

   date_key  full_date
0  20000101 2000-01-01
1  20000102 2000-01-02

In [30]:
df_fact_film_rentals.dtypes

film_key                   float64
title                       object
release_year               float64
rental_duration            float64
rental_rate                float64
length                     float64
replacement_cost           float64
rating                      object
special_features            object
customer_key                 int64
store_key                    int64
first_name                  object
last_name                   object
email                       object
create_date                 object
payment_key                  int64
rental_key                   int64
amount                     float64
payment_date        datetime64[ns]
dtype: object

# spilt up date times

In [31]:
# runs with error - ignore
df_fact_film_rentals['payment_time']= df_fact_film_rentals['payment_date'].dt.time
df_fact_film_rentals['payment_date']= df_fact_film_rentals['payment_date'].dt.date

df_fact_film_rentals['create_time']= df_fact_film_rentals['create_date'].dt.time
df_fact_film_rentals['create_date']= df_fact_film_rentals['create_date'].dt.date

df_fact_film_rentals.head(2)

AttributeError: Can only use .dt accessor with datetimelike values

In [32]:
df_fact_film_rentals['payment_date']= pd.to_datetime(df_fact_film_rentals['payment_date'], format='%Y-%m-%d')

df_fact_film_rentals.head(2)

,film_key,title,release_year,rental_duration,rental_rate,length,replacement_cost,rating,special_features,customer_key,store_key,first_name,last_name,email,create_date,payment_key,rental_key,amount,payment_date,payment_time
0,1.0,ACADEMY DINOSAUR,2006.0,6.0,0.99,86.0,20.99,PG,"Deleted Scenes,Behind the Scenes",1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,2006-02-14 22:04:36,1,76,2.99,2005-05-25,11:30:37
1,2.0,ACE GOLDFINGER,2006.0,3.0,4.99,48.0,12.99,G,"Trailers,Deleted Scenes",1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,2006-02-14 22:04:36,2,573,0.99,2005-05-28,10:35:23

In [33]:
df_fact_film_rentals['create_date']= pd.to_datetime(df_fact_film_rentals['create_date'], format='%Y-%m-%d')
df_fact_film_rentals.head(2)

,film_key,title,release_year,rental_duration,rental_rate,length,replacement_cost,rating,special_features,customer_key,store_key,first_name,last_name,email,create_date,payment_key,rental_key,amount,payment_date,payment_time
0,1.0,ACADEMY DINOSAUR,2006.0,6.0,0.99,86.0,20.99,PG,"Deleted Scenes,Behind the Scenes",1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,2006-02-14 22:04:36,1,76,2.99,2005-05-25,11:30:37
1,2.0,ACE GOLDFINGER,2006.0,3.0,4.99,48.0,12.99,G,"Trailers,Deleted Scenes",1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,2006-02-14 22:04:36,2,573,0.99,2005-05-28,10:35:23

##### Lookup the DateKeys from the Dim Date Table.

In [34]:
# Lookup the Surrogate Primary Key (date_key) that Corresponds to the "payment_date" Column.
df_dim_payment_date = df_dim_date.rename(columns={"date_key" : "payment_date_key","full_date" : "payment_date"})
df_fact_film_rentals = pd.merge(df_fact_film_rentals, df_dim_payment_date, on='payment_date', how='left')
df_fact_film_rentals.drop(['payment_date'],axis=1, inplace=True)
df_fact_film_rentals.head(2)

,film_key,title,release_year,rental_duration,rental_rate,length,replacement_cost,rating,special_features,customer_key,store_key,first_name,last_name,email,create_date,payment_key,rental_key,amount,payment_time,payment_date_key
0,1.0,ACADEMY DINOSAUR,2006.0,6.0,0.99,86.0,20.99,PG,"Deleted Scenes,Behind the Scenes",1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,2006-02-14 22:04:36,1,76,2.99,11:30:37,20050525
1,2.0,ACE GOLDFINGER,2006.0,3.0,4.99,48.0,12.99,G,"Trailers,Deleted Scenes",1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,2006-02-14 22:04:36,2,573,0.99,10:35:23,20050528

In [35]:
# Lookup the Surrogate Primary Key (date_key) that Corresponds to the "create_date" Column.
df_dim_create_date = df_dim_date.rename(columns={"date_key" : "create_date_key","full_date" : "create_date"})
df_fact_film_rentals = pd.merge(df_fact_film_rentals, df_dim_create_date, on='create_date', how='left')
df_fact_film_rentals.drop(['create_date'],axis=1, inplace=True)
df_fact_film_rentals.head(2)

,film_key,title,release_year,rental_duration,rental_rate,length,replacement_cost,rating,special_features,customer_key,store_key,first_name,last_name,email,payment_key,rental_key,amount,payment_time,payment_date_key,create_date_key
0,1.0,ACADEMY DINOSAUR,2006.0,6.0,0.99,86.0,20.99,PG,"Deleted Scenes,Behind the Scenes",1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,1,76,2.99,11:30:37,20050525,NaN
1,2.0,ACE GOLDFINGER,2006.0,3.0,4.99,48.0,12.99,G,"Trailers,Deleted Scenes",1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,2,573,0.99,10:35:23,20050528,NaN

# Perform additional transformations to the fact table

In [36]:
#drop some columns of no particular interest
drop_columns = ['special_features','create_date_key','payment_time']
df_fact_film_rentals.drop(drop_columns, axis=1, inplace=True)

In [37]:
#reorder the columns
ordered_columns = ['customer_key','rental_key','payment_date_key','film_key','store_key','first_name','last_name','email'
                   ,'amount','title','release_year','length','rating','rental_rate','rental_duration',
                   'replacement_cost'
                  ]
df_fact_film_rentals = df_fact_film_rentals[ordered_columns]
#insert a new column, with an ever-incrementing numeric value, to serve as the primary key.
df_fact_film_rentals.insert(0,'fact_film_rental_key', range(1, df_fact_film_rentals.shape[0]+1))
df_fact_film_rentals.head(2)

,fact_film_rental_key,customer_key,rental_key,payment_date_key,film_key,store_key,first_name,last_name,email,amount,title,release_year,length,rating,rental_rate,rental_duration,replacement_cost
0,1,1,76,20050525,1.0,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,2.99,ACADEMY DINOSAUR,2006.0,86.0,PG,0.99,6.0,20.99
1,2,1,573,20050528,2.0,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,0.99,ACE GOLDFINGER,2006.0,48.0,G,4.99,3.0,12.99

### Write the DataFrame Back to the Database

In [38]:
dataframe = df_fact_film_rentals
table_name = 'fact_film_rentals'
primary_key = 'fact_film_rental_key'
db_operation = 'insert'

set_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, dataframe, table_name, primary_key, db_operation)

### Demonstrate that the New Data Warehouse Exists and Contains the Correct Data

In [39]:
sql_test = "SELECT last_name, AVG(length) FROM sakila_dm.fact_film_rentals GROUP BY last_name;"

df_test = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, src_dbname, sql_test)
df_test.head(2)

  last_name  AVG(length)
0     SMITH   104.187500
1   JOHNSON   123.518519

In [40]:
sql_test2 = "SELECT rental_rate*rental_duration AS 'Total Rental Cost' FROM sakila_dm.dim_film ;"


df_test2 = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, src_dbname, sql_test2)
df_test2.head(2)

   Total Rental Cost
0               5.94
1              14.97

In [41]:
sql_test3 = "SELECT * FROM sakila_dm.dim_rental;"


df_test3 = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, src_dbname, sql_test3)
df_test3.head(2)

,rental_key,rental_date,inventory_key,customer_key,return_date
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33